Case_0/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5   -0.8  -0.7)   // Vertice 0: extremo inferior izquierdo trasero
    ( 5   -0.8  -0.7)   // Vertice 1: extremo inferior derecho trasero
    ( 5    1.8  -0.7)   // Vertice 2: extremo inferior derecho delantero
    (-5    1.8  -0.7)   // Vertice 3: extremo inferior izquierdo delantero
    (-5   -0.8   1.3)   // Vertice 4: extremo superior izquierdo trasero
    ( 5   -0.8   1.3)   // Vertice 5: extremo superior derecho trasero
    ( 5    1.8   1.3)   // Vertice 6: extremo superior derecho delantero
    (-5    1.8   1.3)   // Vertice 7: extremo superior izquierdo delantero
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 52 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other bcs
    oversetPatch
    {
        type overset;
        faces ();
    }
    inlet
    {
        type patch;
        faces
        (
           (0 4 7 3)
        );
     }
     outlet
     {
        type patch;
        faces
        (
           (1 5 6 2)
        );
     }
     ground
     {
        type wall;
        faces
        (
           (0 1 2 3)
        );
     }
     atmosphere
     {
        type patch;
        faces
        (
            (4 5 6 7)
        );
     }
     Walls
     {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
     }
);

mergePatchPairs
(
);


// ************************************************************************* //
