Case_0/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//libs            (overset fvMotionSolvers);
libs            ("liboverset.so");

application     overInterDyMFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         10;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2.0;

maxAlphaCo      2.0;

maxDeltaT       1;

functions
{
/*
    probes
    {
        type            probes;
        libs            (sampling);

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl    timeStep;
        writeInterval   1;

        // Fields to be probed
        fields          (p U);

        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cell;

        probeLocations
        (
            (0.00132  0.0009 0.005)
        );
    }

    alphaVol
    {
        // Mandatory entries
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        fields          (alpha.water);
        operation       volIntegrate;
        regionType      all;

        // Optional entries
        postOperation   none;
        // Write at same frequency as fields
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             true;
    }
 */
    freeSurface
    {
        type            surfaces;
        fucntionObjetLibs
        (
        	"libsampling.so"
        );
        // Name of the directory for probe data
        writeControl outputTime;
        // Write at same frequency as fields
        //writeControl    timeStep;
        outputInterval 1;
        surfaceFormat stl;
        //writeInterval   1;

        // Fields to be probed
        //fields          (p U);

        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cellPoint;
        
        /*
        probeLocations
        (
            (0.00132  0.0009 0.005)
        );
        */
        fields
        (
        	alpha.water
        );
        
    }
 
 
}


// ************************************************************************* //
